/*************************************************************************
	> File Name: ep25.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 09时58分41秒
 ************************************************************************/

#include<stdio.h>
//循环数组与大数相加
int fib[3][1005] = {{0,0},{1,1},{1,1}};//用三个数组表示fib求解的三个变量
//fib[1] add fib[2] to fib[0] at first
int n = 2;//从最后一个开始循环这样才能在下一个回到fib[0]
int main(){
    while (fib[n%3][0]<1000){
        n++;
        int *a =fib[n%3],*b=fib[(n-1)%3],*c=fib[(n-2)%3];

        for (int i=1;i<=b[0];i++){//b[0]比c[0]大
            a[i]=b[i]+c[i];
        }
        a[0]=b[0];
        for (int i=1;i<=a[0];i++){
            if (a[i]<10) continue;
            a[i+1]+=a[i]/10;
            a[i]=a[i]%10;
            a[0]+=(i==a[0]);
        }
                            
    }
    printf("%d\n",n);
    return 0;
}
